Repository: AAWESOMEUSERNAME/ariticle
Catalog: The Old Timer/omegaT/omegaT-level2.tmx
Source language: en_us
Languages: zh_cn

source: A great original dancer might only know five basic moves, but they could do those moves all night long, and happily, because they could dance the shit out of those five moves.
zh_cn: 一个伟大的根源舞者可能只知道5中基础舞步，但他们可以用这5种步子开心的跳一整晚，因为他们能用这5种步子跳出各种花样。

source: A look at the late-2000s dance floor shows me that a lot of people think a Charleston pulse should be danced to all swing music regardless of how smooth it is.
zh_cn: 2000年代晚期的片子里我感受到的是很多人认为跳任何摇摆乐的曲子时，不论曲子本身多么丝滑，都应该有查尔斯顿的律动。

source: A shot of the early 2000s show me that a lot of people thought swing was perfectly recreating Hollywood movie dancers, or trying to be as musical as possible with a groove style.
zh_cn: 2000年代早期的片子给我的感觉是大部分人认为摇摆舞就是完美复刻好莱坞舞星，或者尽可能以一种华丽的风格表现音乐。

source: A shot of the late 1990s shows me that most people thought swing dancing was a Gap ad: nothing but turns, kicks and aerials.
zh_cn: 1990年代的片子给我的感觉是大部分人认为摇摆舞就是Gap的广告那样：要么转圈、踢腿，要么空中舞步。

source: All of which point to calculating our dancing based on what we see others do versus what we feel like doing when we ourselves listen to the music.
zh_cn: 这些现象最终表明，我们的舞蹈是所见他人跳舞方式与自己听到音乐时的感受相互拉扯的产物。

source: And if you felt like making noise, you screamed or yelled or whooped or giggled.
zh_cn: 如果你想要搞出些声响，你就会尖叫呐喊大笑不止。

source: And those five moves would all be done with a personal, individual style.
zh_cn: 并且这5种步子都会以一种个性化的方式呈现出来。

source: And we try to capture that feeling–the feeling Frankie Manning had plastered on his face every time he danced.
zh_cn: 我们试图抓住那种感觉，那种Frankie Manning跳舞时总是挂在脸上的感觉

source: As a whole, our technique, our understanding of dance mechanics, and micro musicality is a lot better than the original dancers, and many of them have stated as much.
zh_cn: 整体来看，我们的技术，我们对跳舞原理的理解，以及围观音乐性，都比根源要好太多了，很多根源舞者也确实这么说过。

source: As ideal as that sounds, I think I would be doing a disservice to ourselves and the original dancers if we treat them only with nostalgia: pretending times were automatically better then, and everything they did was better than now.
zh_cn: 我想如果仅站在恋旧的立场上看待根源舞者，假装过去的自然就是更好的，他们跳的就是比现在的舞者好，不论是对他们还是对我们都将是一种伤害。

source: But I do think, like we all too often do in the modern times, we have adopted and progressed something without paying close attention to where it came from.
zh_cn: 但是我认为，现代生活中的我们在追求一些事物的同时，忽视了对其来源的探究。

source: Certainly this is not the case.
zh_cn: 我们当然不会这样。

source: Conclusion: Making Noise
zh_cn: 尾声：发出你的声响

source: I think it’s particularly easy for many modern dancers to fall into the trap that, if you know the moves, and try to emulate the way someone else does them, then you’ll be able express that same feeling–but that’s like looking at a map and a picture of a place and thinking you’ve been there.
zh_cn: 现代舞者很容易陷入一种误区：如果你知道了那些动作，并努力模仿别人做这个动作的方式，就可以表达相同的感觉。这相当于看着地图和照片就认为自己去过这个景点。

source: If it wasn’t swing music, then you weren’t going to do swing to it.
zh_cn: 如果音乐不摇摆，你也不会跟着摇摆。

source: It wasn’t what they did; it was the way they did it.
zh_cn: 重要的不是我们做了什么，而是我们如何去做。

source: It’s beautifully simple and honest, and shows why certain aspects of the modern scene in the last ten years look different than the original dancers.
zh_cn: 这种精神散发着简单真挚的美，同时也展现出为什么在某些特定的方面，过去10年现代舞者会不同于根源舞者们。

source: Most of us feel something very powerful when we listen to a great swing song, or watch Hellzapoppin.
zh_cn: 我们中的大部分人在听到一首好的摇摆乐或看《Hellzapoping》时会感受到一股强烈的冲击。

source: Perhaps the spirit of the original jitterbugs is as simple as that: All they knew about swing was what they heard when they stepped onto the dance floor.
zh_cn: 或许根源精神就是一句简单的话：踏入舞池时听到的是什么，他们的摇摆舞就是什么。

source: Though classes, counts, and moves can make us really great dancers, the spirit of the original jitterbug doesn’t originate there.
zh_cn: 尽管上课、计拍法以及各种动作可以让我们成为好的舞者，但是根源精神并不天然的存在于其中。

source: When I look back at the dance floors of the last ten years, I see a lot of things (A lot of which I saw in myself, as well).
zh_cn: 回看过去十年的舞池，我看到了很多现象（一些同样发生在我身上的现象）。

source: 旧时代舞者（尾声：燥起来）
zh_cn: 旧时代舞者（尾声：发出你的声响）
